
<!-- header -->
```fish
plan -chdir=sample/instance -workspace=dev -var-file=env/dev.tfvars -lock=false
```
<!-- fmt -->

<!-- outline -->
<details><summary>Outline of changes.</summary>

```diff
! aws_instance.sample must be replaced
```
</details>
<!-- main -->
<details><summary>Plan: 1 to add, 0 to change, 1 to destroy.</br>

###### TF Sample by @RDhar via [pull_request](https://github.com/DevSecTop/TF-via-PR/actions/runs/10551359391/job/29243394922) at 2024-08-26T00:26:19Z.
</summary>

```hcl

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

OpenTofu will perform the following actions:

  # aws_instance.sample must be replaced
-/+ resource "aws_instance" "sample" {
      ~ ami                                  = "ami-03e31863b8e1f70a5" -> "ami-0ad554caf874569d2" # forces replacement
      ~ arn                                  = "arn:aws:ec2:us-east-1:813676077823:instance/i-0eb108138aa37f677" -> (known after apply)
      ~ associate_public_ip_address          = true -> (known after apply)
      ~ availability_zone                    = "us-east-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      ~ iam_instance_profile                 = "AmazonSSMRoleForInstancesQuickSetup" -> (known after apply)
      ~ id                                   = "i-0eb108138aa37f677" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      + key_name                             = (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-02a38beb783628aa9" -> (known after apply)
      ~ private_dns                          = "ip-172-31-11-73.ec2.internal" -> (known after apply)
      ~ private_ip                           = "172.31.11.73" -> (known after apply)
      ~ public_dns                           = "ec2-44-222-164-23.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "44.222.164.23" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [
          - "default",
        ] -> (known after apply)
      + spot_instance_request_id             = (known after apply)
      ~ subnet_id                            = "subnet-0d90118a9dadf4f0b" -> (known after apply)
        tags                                 = {
            "Name" = "sample-instance"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-05c35f948b66e1a9d",
        ] -> (known after apply)
        # (5 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 1 -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 2 -> null
          - http_tokens                 = "required" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - tags_all              = {
              - "Environment" = "Development"
              - "Stack"       = "instance"
              - "Terraform"   = "dev"
            } -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0ea654d6e5abe18b8" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ sample_instance_id = "i-0eb108138aa37f677" -> (known after apply)

```
</details>
<!-- footer -->
<!-- tofu.274.-chdir-sample-instance.-workspace-dev.-var-file-env-dev-tfvars.-out-tfplan -->